{
  "list": [
    {
      "field": "A commit comment is created",
      "value": "commit_comment",
      "desc": "Triggered when a new comment is created on a commit in the connected GitHub repos. It corresponds to the commit_comment event in the GitHub API."
    },
    {
      "field": "A Git branch or tag is created",
      "value": "create",
      "desc": "Triggered when a new branch or tag is created on the connected Github repos. It corresponds to the create event in the GitHub API."
    },
    {
      "field": "A Git branch or tag is deleted",
      "value": "delete",
      "desc": "Triggered when a new branch or tag is deleted on the connected Github repos. It corresponds to the create event in the GitHub API."
    },
    {
      "field": "Activities related to a discussion",
      "value": "dicussion",
      "desc": "Triggered when a new discussion thread is created, edited, or deleted on any of the connected GitHub repos. It corresponds to the discussion event in the GitHub API."
    },
    {
      "field": "Activities related to a comment in a discussion",
      "value": "discussion_comment",
      "desc": "Triggered when a new discussion comment is created or edited in the connected GitHub repos. It corresponds to the discussion_comment event in the GitHub API."
    },
    {
      "field": "Someone forks a repository",
      "value": "fork",
      "desc": "Triggered when a new fork is created on the connected Github repos. It corresponds to the fork event in the GitHub API."
    },
    {
      "field": "Activity related to an issue or a pull request comment",
      "value": "issue_comment",
      "desc": "Triggered when a comment is created, edited, or deleted on the connected GitHub repos. It corresponds to the issue_comment event in the GitHub API. "
    },
    {
      "field": "Activity related to an issue",
      "value": "issues",
      "desc": "Triggered when an issue is created, edited, labeled, deleted, etc. on the connected Github repos. It corresponds to the issue event in the GitHub API."
    },
    {
      "field": "Activity related to a label",
      "value": "label",
      "desc": "Triggered when a label is created, edited, or deleted on the connected Github repos. It corresponds to the label event in the GitHub API. "
    },
    {
      "field": "Activity related to a GitHub Marketplace purchase",
      "value": "marketplace_purchase",
      "desc": "Triggered when a marketplace is purchased, changed, or canceled on the connected Github repos. It corresponds to the marketplace_purchase event in the GitHub API."
    },
    {
      "field": "Activity related to pull requests",
      "value": "pull_request",
      "desc": "Triggered when a PR is created, edited, labeled, deleted, etc., on the connected Github repos. It corresponds to the pull_request event in the GitHub API."
    },
    {
      "field": "Activity related to pull request reviews",
      "value": "pull_request_review",
      "desc": "Triggered when a PR is created, edited, or deleted on the connected Github repos. It corresponds to the pull_request_review event in the GitHub API."
    },
    {
      "field": "Activity related to pull request review comments",
      "value": "pull_request_review_comment",
      "desc": "Triggered when a PR review comment is created, edited, or deleted on the connected Github repos. It corresponds to the pull_request_review_comment event in the GitHub API."
    },
    {
      "field": "Activity related to a release",
      "value": "release",
      "desc": "Triggered when a release, pre-release, or draft of a release is released, edited, deleted, etc., on the connected Github repos. It corresponds to the release event in the GitHub API."
    },
    {
      "field": "Activity related to a repository",
      "value": "repository",
      "desc": "Triggered when the connected Github repo is created, edited, deleted, etc. It corresponds to the repository event in the GitHub API."
    },
    {
      "field": "Activity related to a repository being starred",
      "value": "star",
      "desc": "Triggered when the connected Github repo is starred or unstarred. It corresponds to the star event in the GitHub API."
    },
    {
      "field": "Activities related to a GitHub Actions workflow job",
      "value": "workflow_job",
      "desc": "Triggered when a GitHub action is queued, in progress, or completed on the connected Github repos. It corresponds to the workflow_job event in the GitHub API."
    },
    {
      "field": "One or more commits are pushed to a repo branch or tag",
      "value": "push",
      "desc": "Triggered when commits are push to the connected Github repos. It corresponds to the push event in the GitHub API."
    }
  ]
}
